src/Documents/КАЗ_СогласованиеЗаявки/КАЗ_СогласованиеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_СогласованиеЗаявки</name>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>EnumRef.КАЗ_РешенияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/КАЗ_РешенияСогласования/КАЗ_РешенияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАЗ_РешенияСогласования</name>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноНаДоработку</name>
  </enumValues>
</mdclass:Enum>

src/Enums/КАЗ_СтатусыЗаявки/КАЗ_СтатусыЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАЗ_СтатусыЗаявки</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>ВРеестре</name>
  </enumValues>
  <enumValues>
    <name>Оплачена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Documents/КАЗ_СогласованиеЗаявки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не выбрана заявка на оплату.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Решение) Тогда
		Сообщить("Не выбрано решение по согласованию.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Согласующий) Тогда
		Сообщить("Не указан согласующий.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбъектЗаявки = Заявка.ПолучитьОбъект();

	Если Решение = Перечисления.КАЗ_РешенияСогласования.Согласовано Тогда
		ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Согласована;
	ИначеЕсли Решение = Перечисления.КАЗ_РешенияСогласования.Отклонено Тогда
		ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Отклонена;
	ИначеЕсли Решение = Перечисления.КАЗ_РешенияСогласования.ВозвращеноНаДоработку Тогда
		ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Черновик;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаРешения) Тогда
		ДатаРешения = ТекущаяДата();
	КонецЕсли;

	ОбъектЗаявки.Записать();

КонецПроцедуры
